@thumb
;0x29410 からか、ここに飛んで来るコードをかかないとダメです。(FE8J)
;0x29468 からか、ここに飛んで来るコードをかかないとダメです。(FE8J)
;
;フリー領域を使います。
;@org	$8E4F740
	ldrb r0,[r4,#0x8]	;;能力補正の体格値 (jumpコードで壊す処理)
	ldrb r1,[r5,#0x1A]	;;アイテムの体格の補助値が
	cmp r0,#0xFF		;;255 ならばやせよう
	beq yase
	add r0,r0,r1
	b store
yase
	cmp     r1,#0x2		;体格補正値が2未満ならば0にしないとおかしなことに
	blt		zero		
	sub r0,r1,#0x2		;ダイエット 本当は体格を2下げたいのに
						;なぜか1しか減らないんだよね。なんでだろう？
	b store
zero
	mov r0,#0x0			  ;体格補正値を0にする
store
	strb  r0,[r6,#0x1A]   ;;体格補正値をストア

;;ここに元に元のアドレスに戻す儀式のコードをかく

;ldr r1,=$08029418	;FE8J
ldr r1,=$08029470	;FE8U
mov pc,r1
